#!/usr/bin/env python3.6
# -*- coding: UTF-8 -*-

DEBUG = False
SHOW = False

ini_task_list = [(10, 6), [((2, 2), 3)], [((3, 2), 8), ((2, 3), 4)]]

'''
ini_task_list = [
        [4, 4],             # размеры стола[w, h]    
        
        [                   # прямоугольные полимино[((w, h), N)...]
            ((2, 2), 1)
        ], 
                      
        [                   # L-полимино [((w, h), N)...]
            #((3, 3), 1), 
            #((2, 3), 1), 
            #((3, 2), 1), 
            ((2, 2), 4)
        ]    
    ]

 